app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT "urls".* FROM "urls"

  def create
    @url = Url.new(url_params)

    respond_to do |format|
      if @url.save
---
INSERT INTO "urls" ("created_at", "updated_at", "original") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-11-30 02:16:00.154520"], ["updated_at", "2017-11-30 02:16:00.154520"], ["original", "https://www.google.com/analytics/#?modal_active=none"]]

  def update
    respond_to do |format|
      if @url.update(url_params)
---
UPDATE "urls" SET "original" = $1, "updated_at" = $2 WHERE "urls"."id" = $3  [["original", "https://google.com"], ["updated_at", "2017-12-07 14:50:15.461313"], ["id", 2]]

    def set_url
      @url = Url.find(params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]